In [ ]:
import pandas as pd

In [3]:
data = {"Name":['naseef','akash', 'naja'],
        "Age":[23,23,22],
        "place":['calicut','calicut','vadakara']}

df = pd.DataFrame(data)
df

     Name  Age     place
0  naseef   23   calicut
1   akash   23   calicut
2    naja   22  vadakara

In [4]:
df['place']

0     calicut
1     calicut
2    vadakara
Name: place, dtype: object

In [5]:
df.iloc[:2]

     Name  Age    place
0  naseef   23  calicut
1   akash   23  calicut

In [6]:
df['marks'] = [22,33,44]

In [7]:
df

     Name  Age     place  marks
0  naseef   23   calicut     22
1   akash   23   calicut     33
2    naja   22  vadakara     44

In [11]:
df.drop('place', axis=1, inplace=True)

In [12]:
df

     Name  Age  marks
0  naseef   23     22
1   akash   23     33
2    naja   22     44

In [19]:
data = {"Name":['naseef','naseef', 'naja'],
        "Age":[23,23,22],
        "place":['calicut','calicut','vadakara']}

df = pd.DataFrame(data)
df

     Name  Age     place
0  naseef   23   calicut
1  naseef   23   calicut
2    naja   22  vadakara

In [20]:
df.drop_duplicates()

     Name  Age     place
0  naseef   23   calicut
2    naja   22  vadakara